case/singleParticle/constant/couplingDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "couplingDict";
    object      couplingDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


TFM
{
    useTFMGas   true;
    
    useTFMSource    true;
    
    gridOrigin (-0.1 -0.1 -0.1);

    gridVertex (0.1 0.1 0.1);
        
    gridSize 0.04001;
    
    //for perellel decompose
    //how many times that a proc is larger than the coarseGridSize
//     procSizeX 12;
//     procSizeY 9;
//     procSizeZ 9;
}


// ************************************************************************* //
