case/singleParticle/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|G)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-05;
        relTol          0.1;
    }

   "(rho|G)Final"
    {
        $rho;
        tolerance       1e-05;
        relTol          0;
    }

    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    pFinal
    {
        $p;
        tolerance       1e-06;
        relTol          0;
    }
    "Ii.*"
    {
        solver              GAMG;
        tolerance           1e-4;
        relTol              0;
        smoother            symGaussSeidel;
        maxIter             1;
        nPostSweeps         1;
    }

    "G.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-04;
        relTol          0;
    }

    "(U|h|R|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    "(U|h|R|k|epsilon)Final"
    {
        $U;
        tolerance       1e-05;
        relTol          0;
    }

    "(Yi|tar|N2|CH2O|O|CH4|CH3|CH2|H|NCO|CH2CHO|CO|HO2|HNO|OH|H2O|C2H6|C2H5|C2H4|C2H3|O2|CH3O|C2H2|NO|NH|N2O|AR|CO2|NH3|NH2|HCO|HCN|H2|N)"

    {
        $h;
    }

    "(Yi|tar|N2|CH2O|O|CH4|CH3|CH2|H|NCO|CH2CHO|CO|HO2|HNO|OH|H2O|C2H6|C2H5|C2H4|C2H3|O2|CH3O|C2H2|NO|NH|N2O|AR|CO2|NH3|NH2|HCO|HCN|H2|N)Final"
    {
        $Yi;
        tolerance       1e-06;
        relTol          0;
    }
}

PIMPLE
{
    transonic       yes;
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
    momentumPredictor yes;
}


relaxationFactors
{
    fields
    {
        ".*"            1;
    }
    equations
    {
        ".*"            1;
    }
}


// ************************************************************************* //
